{
    "trustName": "Noongar Boodja Trust",
    "basicInformation": {
        "dateOfDeed": "not found",
        "settledSum": "not found",
        "governingLaw": "The laws of Western Australia."
    },
    "trustTerm": {
        "commencementDate": "not found",
        "terminationDate": "not found"
    },
    "parties": {
        "settlor": {
            "name": "Noongar Boodja Trust",
            "address": "care of South West Aboriginal Land and Sea Council, Level 2, 100 Royal Street, East Perth, Western Australia",
            "restrictions": "Yes. Clause 22.3(a) provides that, subject to clause 22.3(b), the Settlor (and the Settlor’s legal personal representative or Associate) may not become an Eligible Noongar Entity or directly or indirectly receive any part of the Trust Fund or its income."
        },
        "trustee": {
            "name": "Perpetual Trustee Company Limited",
            "acn": "000 001 007",
            "address": "Level 18, 123 Pitt Street, Sydney, New South Wales",
            "director": "not found"
        },
        "appointor": {
            "name": "Attorney General, Noongar Appointor",
            "powers": [
                "The Attorney General and the Noongar Appointor act jointly as the Appointors. Acting together and by instrument in writing, they may remove the Trustee, appoint additional Trustees who meet the clause 13.2 qualifications, and appoint a new Trustee to replace a Trustee who resigns or ceases by operation of law. Before exercising these powers, they must consult with the Noongar Advisory Company and the existing or outgoing Trustee, and before removing a Trustee they must consider whether the Trustee has breached or failed to act satisfactorily under the Deed. They may request the Trustee to conduct an appropriate selection process for a replacement trustee, and if there is no Trustee, they must conduct that selection process in consultation with the Noongar Advisory Company. When a Nominee Entity is proposed, they must assess whether it meets the Dedicated Trustee Requirements and, if they decide not to appoint it, provide written reasons sufficient to enable it to remedy the issues. Upon exercising their powers, they ensure the incoming and outgoing trustees execute a Deed of Appointment substantially in the form in Schedule 8. The Attorney General must act jointly with the Noongar Appointor for appointments and removals under clause 13.4."
            ]
        }
    }
